[
    {
        "name": "International Travel Event",
        "address": "Saigon Exhibition and Convention Center, 799 Nguyen Van Linh, Tan Phu Ward, District 7, Ho Chi Minh City, Vietnam",
        "host_url": "vnat",
        "location": [
            10.731026131997236,
            106.72128995111119
        ],
        "date": "07/09/2023 - 09/09/2023",
        "entrance_fee": "Free",
        "opening_hours": "9:00 AM - 5:00 PM",
        "short_description": "An anual event to promote travel and local business",
        "full_description": "ITE HCMC 2023 is the leading and prestigious annual international tourism trade event in Vietnam. It is the 16th edition of ITE HCMC, scheduled to be held in 2023 with the theme 'Together Strong, Together Rise.' The event is organized by the People's Committee of Ho Chi Minh City in coordination with the Ministry of Culture, Sports and Tourism. ITE HCMC 2023 is a combination of physical and online events, incorporating online B2B meetings, conferences, and live broadcasts.\n\nThis annual international tourism event aims to enhance exchange, promote tourism, and expand business opportunities for companies both domestic and international. Moreover, ITE HCMC 2023 will feature a hybrid format, combining physical and online elements such as 2D online booths, 3D virtual exhibitions, and online meetings between international buyers and sellers.",
        "image_url": "itehcm",
        "popular_activities": [
            "Travel market seminar",
            "Travel Consumer Festival.",
            "ITE HCMC 2023 Travel Awards.",
            "Tourism forum"
        ],
        "reason": "The event will feature exciting activities including the opening ceremony and themed Gala Dinner 'Vietnamese Night', ITE Travel Awards, workshops on key tourism markets, conferences discussing the recovery plan for tourism in Ho Chi Minh City and Vietnam in the new normal context, and the Vietnam-Asia MICE Tourism Forum.",
        "category": "Fair",
        "link": "https://itehcmc.travel",
        "youtube_url": "https://www.youtube.com/watch?v=7Ie5XWvdlRI&ab_channel=DulịchTP.HồChíMinh%23VibrantHoChiMinhCity"
    },
    {
        "name": "Theme Park Vietnam Expo",
        "address": "Pavillon Restaurant, 202 Hoang Van Thu, Ward 9, Phu Nhuan District, Ho Chi Minh City, Vietnam",
        "host_url": "ftm",
        "location": [
            10.801298413310226,
            106.67080297994795
        ],
        "date": "23/08/2023 - 24/08/2023",
        "entrance_fee": "Free",
        "opening_hours": "9:00 AM - 5:00 PM",
        "short_description": "A free exhibition for Landscape Machinery, Amusement Parks, and Water Park",
        "full_description": "Theme Park Expo Vietnam 2023 – Landscape Service Machinery and Equipment Exhibition, Entertainment Park, and Water Park, is the only event of its kind to be held in Vietnam on August 23rd and 24th, 2023, at Tan Son Nhat Conference Center, 202 Hoang Van Thu Street, Ward 9, Phu Nhuan District, Ho Chi Minh City.\n\nThis expo serves as a gathering place for investors from various sectors, including amusement parks, water parks, and entertainment centers. Notably, renowned global companies and corporations such as Technical Park, Zamperla Asia Pacific, VEKOMA RIDES, ProSlide, Polin, and Embed are actively participating in the event.",
        "image_url": "themeparkexpo",
        "popular_activities": [
            "VR Games",
            "Cosplay",
            "Pump it up",
            "Minigame"
        ],
        "reason": "Theme Park Expo Vietnam 2023 promises to be a platform for expanding trade relationships and sharing experiences through conferences featuring top speakers in the Entertainment Industry.",
        "category": "Expo",
        "link": "https://www.themeparkvietnam.com",
        "youtube_url": "https://www.youtube.com/watch?v=Kcl4l_PO3UY&ab_channel=GTIAmuse"
    },
    {
        "name": "OCTF 2023",
        "address": "Saigon Exhibition and Convention Center, 799 Nguyen Van Linh, Tan Phu Ward, District 7, Ho Chi Minh City, Vietnam",
        "host_url": "ccpit",
        "location": [
            10.730889096220887,
            106.72134359529166
        ],
        "date": "21/09/2023 - 23/09/2023",
        "entrance_fee": "Free",
        "opening_hours": "9:00 AM - 5:00 PM",
        "short_description": "Intelligent Technology Exhibition in Ho Chi Minh City",
        "full_description": "From September 21 to September 23, 2023, the Smart Technology Exhibition - OCTF 2023, organized by Guangdong International Exhibition Company Limited in collaboration with reputable supporting units and guidance organizations, will officially take place in Ho Chi Minh City. The exhibition will cover an area of over 5000 square meters with more than 200 booths showcasing thousands of advanced and high-end technological products from leading technology companies in China and Asia.\n\nThe Smart Technology Exhibition Vietnam 2023 aims to promote trade, enabling Vietnamese businesses to access potential customers and high-quality products, explore the market, learn about the displayed products, and meet potential partners. The exhibition brings together smart technology companies in the fields of electronics manufacturing and footwear production, showcasing new products and advanced technological solutions in electronic components and accessories, electronic manufacturing equipment, automation technology in production, machinery for footwear production, and leather equipment.",
        "image_url": "octf",
        "popular_activities": [
            "Exhibitors",
            "Conferences",
            "Speeches"
        ],
        "reason": "Join this expo to explore cutting-edge technologies, connect with potential customers and partners, and stay updated on industry trends. Expand your business network and discover innovative technologies to boost your company's competitiveness.",
        "category": "Expo",
        "link": "https://sansukien.com/su-kien/octf",
        "youtube_url": "https://www.youtube.com/watch?v=STPtX9s5JmE&ab_channel=OCTFOfficial"
    },
    {
        "name": "VIFA Asean 2023",
        "address": "Saigon Exhibition and Convention Center, 799 Nguyen Van Linh, Tan Phu Ward, District 7, Ho Chi Minh City, Vietnam",
        "host_url": "lmwoods",
        "location": [
            10.730889096220887,
            106.72134359529166
        ],
        "date": "29/08/2023 - 01/09/2023",
        "entrance_fee": "Free",
        "opening_hours": "9:00 AM - 6:00 PM",
        "short_description": "Leading Autumn Furniture Export Fair in the Vietnam",
        "full_description": "VIFA ASEAN 2023 is an eagerly anticipated event that will bring together manufacturers and exporters of furniture from the ASEAN region. As a premier Autumn Furniture Export Fair, it aims to showcase the latest designs, innovations, and trends in the furniture industry.\n\nThe event will be held at the prestigious Saigon Exhibition and Convention Center (SECC), a renowned venue known for hosting major international exhibitions and trade shows. With its state-of-the-art facilities and strategic location, the SECC is perfectly poised to accommodate the diverse needs of exhibitors and attendees alike.\n\nDuring the four-day event, industry players will have the opportunity to network, forge new business partnerships, and engage with potential buyers from around the globe. This platform will enable furniture manufacturers to promote their products, exchange valuable insights, and explore possibilities for expanding their reach in the international market.",
        "image_url": "vifa",
        "popular_activities": [
            "Souvenirs",
            "Design gifts",
            "Shopping"
        ],
        "reason": "VIFA ASEAN 2023 is part of a series of international furniture fairs in the autumn season in Asia, including KOFURN (South Korea), IFFINA (Indonesia), CIFF Shanghai & FC Furniture China (China). Therefore, VIFA ASEAN is will be an attractive event, drawing thousands of international buyers and providing numerous benefits for businesses.",
        "category": "Fair",
        "link": "https://vifaasean.com",
        "youtube_url": "https://www.youtube.com/watch?v=B0Pgc3zOuoQ&ab_channel=LienMinhCompany-VIFAFairs%27Organizer"
    },
    {
        "name": "Plase Show HCM",
        "address": "The Adora Center, 431 Hoang Van Thu, Ward 4, Tan Binh District, Ho Chi Minh City, Vietnam",
        "host_url": "nambinh",
        "location": [
            10.798551499052868,
            106.65912154370136
        ],
        "date": "19/10/2023 - 21/10/2023",
        "entrance_fee": "Free",
        "opening_hours": "9:00 AM - 6:00 PM",
        "short_description": "The first exhibition for professional audio equipment, stage, musical instruments, karaoke, and car audio",
        "full_description": "Plase show HCM 2023, also known as KAP SHOW, is the first specialized exhibition in Hanoi, showcasing professional audio equipment, stage equipment, musical instruments, karaoke, and car audio. The event attracted participation from 19 exhibitors with 66 booths, held at THE ADORA CENTER, located at 431 Hoàng Văn Thụ, Ward 4, Tân Bình District, Ho Chi Minh City, from October 19, 2023, to October 21, 2023.\n\nPlase Show is an annual event held in Hanoi and Ho Chi Minh City at the end of October and the beginning of November each year. It is considered a significant event that brings changes to the professional audio market, as Vietnamese manufacturers have shown strong growth, producing various lines of professional speakers to meet domestic demands.",
        "image_url": "plase",
        "popular_activities": [
            "Music performance",
            "Minigames",
            "3D Slideshow"
        ],
        "reason": "Attendees will have the opportunity to firsthand admire and explore the latest and most captivating commercial products, showcasing the hottest product lines in Vietnam. Moreover, visitors will be delighted with enticing gifts offered by the organizers and participating exhibitors",
        "category": "Fair",
        "link": "http://plase.com.vn",
        "youtube_url": "https://www.youtube.com/watch?v=DD4MzxjePhw&ab_channel=TuânAcoustic-Âmthanhsố"
    },
    {
        "name": "Ao Dai Festival",
        "address": "Walking Street, Nguyen Hue Street, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "host_url": "hcmc",
        "location": [
            10.774253064345054,
            106.70365918256074
        ],
        "date": "March",
        "entrance_fee": "Free",
        "opening_hours": "Varies",
        "short_description": "A celebration of the traditional Vietnamese Ao Dai.",
        "full_description": "The Ao Dai Festival in Ho Chi Minh City is a celebration of Vietnam's iconic national costume, the Ao Dai. This cultural extravaganza is held annually, drawing locals and tourists alike to witness the elegance and beauty of this traditional attire.\n\nThe festival takes place amidst the bustling streets and picturesque landmarks of Ho Chi Minh City, creating a vibrant and colorful atmosphere. It showcases the Ao Dai's timeless charm, which has been an integral part of Vietnamese culture for centuries.\n\nDuring the festival, participants of all ages don the graceful Ao Dai in various styles and colors, adding to the kaleidoscope of hues that fill the city streets. Women wear long dresses with high slits, often featuring intricate patterns and delicate embroidery. Meanwhile, men don the more modest version, with straight-cut trousers and a matching tunic.",
        "image_url": "aodaifestival",
        "popular_activities": [
            "Fashion Shows",
            "Cultural Performances",
            "Exhibitions"
        ],
        "reason": "Visitors will immerse themselves in the rich culture of Vietnam, experiencing the beauty and charm of the Ao Dai. The festival provides an excellent opportunity to witness stunning fashion displays and cultural expressions.",
        "category": "Festival",
        "link": "https://en.vietnamplus.vn/ao-dai-festival-to-honour-vietnams-traditional-culture/249079.vnp",
        "youtube_url": "https://www.youtube.com/watch?v=LbDOSb_zNME&ab_channel=VietnamNewsAgency"
    },
    {
        "name": "Vietnam International Fashion Week",
        "address": "7th Military Region Stadium, 2A Phan Dinh Giot, Ward 2, Tan Binh District, Ho Chi Minh City, Vietnam",
        "host_url": "multimedia",
        "location": [
            10.801235153475414,
            106.67088878395992
        ],
        "date": "May",
        "entrance_fee": "1.8M VND",
        "opening_hours": "Varies",
        "short_description": "A fashion showcase from both Vietnamese and international designers.",
        "full_description": "Vietnam International Fashion Week (VIFW) in Ho Chi Minh City is an exhilarating annual event that showcases the country's vibrant fashion industry and puts it on the global stage. With its glitz, glamour, and innovation, VIFW has become a must-attend event for fashion enthusiasts, designers, celebrities, and industry professionals from around the world.\n\nAs the premier fashion extravaganza in Vietnam, VIFW is a celebration of creativity and style, featuring a diverse array of collections from both established and emerging designers. The event serves as a platform for local talents to shine and express their unique perspectives, while also attracting renowned international designers who seek to collaborate and draw inspiration from Vietnam's rich culture and heritage.",
        "image_url": "vnfashionweek",
        "popular_activities": [
            "Fashion Shows",
            "Designer Collections",
            "Fashion Networking"
        ],
        "reason": "The fashion week presents an excellent platform for designers to exhibit their creativity, and fashion enthusiasts can witness cutting-edge designs and gain insights into the ever-evolving world of fashion.",
        "category": "Fashion Event",
        "link": "https://thanhnien.vn/vietnam-international-fashion-week-2023-tags1174056.html",
        "youtube_url": "https://www.youtube.com/watch?v=idn9M8-Y2SY&ab_channel=AquafinaVietnam"
    },
    {
        "name": "Vietnam Motor Show",
        "address": "Saigon Exhibition and Convention Center, 799 Nguyen Van Linh, Tan Phu Ward, District 7, Ho Chi Minh City, Vietnam",
        "host_url": "vama",
        "location": [
            10.730857472571369,
            106.72135432412774
        ],
        "date": "October/November",
        "entrance_fee": "30.000 VND",
        "opening_hours": "Varies",
        "short_description": "A major automobile exhibition featuring the latest models in the industry.",
        "full_description": "The Vietnam Motor Show in Ho Chi Minh City is a highly anticipated and vibrant automotive event that captures the hearts of car enthusiasts and visitors from all over the country. Held annually, this motor show showcases the latest and most innovative offerings from leading automobile manufacturers, making it a hub of excitement and anticipation for automobile lovers.\n\nStepping into the exhibition hall, visitors are greeted with a dazzling display of sleek and cutting-edge vehicles. From luxurious sedans and powerful SUVs to efficient hybrids and electric cars, the Vietnam Motor Show offers a comprehensive array of options for every type of driver. The event not only highlights the latest models but also provides insights into emerging automotive technologies and eco-friendly solutions.\n\nIn addition to the exciting display of automobiles, the Vietnam Motor Show also hosts interactive demonstrations and engaging activities. Dynamic test drives give attendees a chance to experience the thrill of driving their dream cars firsthand, creating unforgettable memories.",
        "image_url": "vietnammotorshow",
        "popular_activities": [
            "Car Displays",
            "Motorcycle Exhibits",
            "Technology Showcase"
        ],
        "reason": "The motor show offers an insight into the advancements and trends in the automotive industry, making it an essential event for car enthusiasts and industry stakeholders.",
        "category": "Expo",
        "link": "https://www.vietnammotorshow.vn/en/",
        "youtube_url": "https://www.youtube.com/watch?v=2TrAB21jLRo&ab_channel=XeTinhtế"
    },
    {
        "name": "New Year Countdown Festival",
        "address": "Nguyen Hue Walking Street, District 1, Ho Chi Minh City, Vietnam",
        "host_url": "hcmccuturalsport",
        "location": [
            10.774253064345054,
            106.70365918256074
        ],
        "date": "December 31",
        "entrance_fee": "Free",
        "opening_hours": "8:00 PM - 12:30 AM",
        "short_description": "A festival to welcome the New Year with live performances and fireworks.",
        "full_description": "The New Year Countdown Festival at Nguyen Hue Walking Street is a vibrant and eagerly anticipated event that takes place in Ho Chi Minh City, Vietnam, every year. This spectacular festival marks the arrival of the New Year with a burst of joy, excitement, and celebration. Nguyen Hue Walking Street, known for its bustling atmosphere and scenic beauty, transforms into a captivating wonderland during this festive occasion.\n\nAs the year draws to a close, the entire street comes alive with dazzling lights, colorful decorations, and a myriad of entertainment options. Families, friends, and visitors from all walks of life gather here to welcome the New Year with open hearts and wide smiles. The festive spirit permeates the air, creating an electrifying atmosphere that is hard to resist.\n\nThroughout the festival, Nguyen Hue Walking Street is abuzz with various activities and performances that cater to people of all ages. Traditional Vietnamese music fills the air, adding a touch of cultural charm to the celebrations. Local artists and performers showcase their talents through mesmerizing dance routines and live music, captivating the audience and infusing the festival with a sense of local pride.",
        "image_url": "countdown",
        "popular_activities": [
            "Live Performances",
            "Cultural Shows",
            "Fireworks Display"
        ],
        "reason": "The New Year Countdown Festival is a memorable event that brings people together to celebrate the beginning of a new chapter, creating lasting memories and starting the year with positivity and hope.",
        "category": "Festival",
        "link": "https://en.vietnamplus.vn/new-year-countdown-music-party-to-be-held-in-downtown-hcm-city/246361.vnp",
        "youtube_url": "https://www.youtube.com/watch?v=TADp19SMx9M&ab_channel=NickNguyen"
    },
    {
        "name": "Nguyen Hue Flower Festival",
        "address": "Nguyen Hue Walking Street, District 1, Ho Chi Minh City, Vietnam",
        "host_url": "hcmc",
        "location": [
            10.774253064345054,
            106.70365918256074
        ],
        "date": "January/February",
        "entrance_fee": "Free",
        "opening_hours": "Varies",
        "short_description": "A floral display along Nguyen Hue Walking Street.",
        "full_description": "The Nguyen Hue Flower Festival is a delightful and enchanting event held annually at the Nguyen Hue Walking Street in Ho Chi Minh City, Vietnam. This vibrant and colorful festival celebrates the beauty of flowers and showcases a dazzling array of floral displays that captivate the senses and warm the hearts of both locals and tourists.\n\nThe Nguyen Hue Walking Street, which spans over a kilometer in length, transforms into a mesmerizing floral wonderland during the festival. The street becomes adorned with a stunning tapestry of flowers, from vibrant blooms to delicate arrangements, creating a picturesque and Instagram-worthy setting for visitors.",
        "image_url": "flowerfestival",
        "popular_activities": [
            "Flower Exhibition",
            "Floral Art Installations",
            "Photo Opportunities"
        ],
        "reason": "The Nguyen Hue Flower Festival is a delightful way to immerse in the festive spirit of Tet, appreciating the beauty of nature's wonders and the artistry of floral design.",
        "category": "Festival",
        "link": "https://www.visithcmc.vn/en/event/duong-hoa-xuan-nguyen-hue-1",
        "youtube_url": "https://www.youtube.com/watch?v=kkI7ZYWX5Pw&ab_channel=AGSEvents%26Media"
    },
    {
        "name": "Nghinh Ong Can Gio Festival",
        "address": "Can Thanh Town, Can Gio District, Ho Chi Minh City, Vietnam",
        "host_url": "cangio",
        "location": [
            10.415513946564618,
            106.9732644775441
        ],
        "date": "September/October",
        "entrance_fee": "Free",
        "opening_hours": "Varies",
        "short_description": "A traditional festival honoring the Whale God and promoting local fishing culture.",
        "full_description": "The Nghinh Ong Can Gio Festival is a vibrant and culturally significant event celebrated annually in Can Gio, a coastal district located southeast of Ho Chi Minh City in Vietnam. This festival is a time-honored tradition deeply rooted in the local fishing community's beliefs and customs, showcasing the region's rich cultural heritage and spiritual practices.\n\nThe festival typically takes place during the eighth lunar month, attracting both locals and visitors who come together to pay homage to the Sea God (Nghinh Ong). The Sea God is revered as the guardian and protector of the fishermen and seafarers, ensuring their safety and prosperity on their voyages across the seas.",
        "image_url": "nghinhhongcangio",
        "popular_activities": [
            "Whale God Procession",
            "Folk Music and Dance",
            "Offering Rituals"
        ],
        "reason": "The Nghinh Ong Cangio Festival is not only a cultural celebration but also an occasion for locals to pray for favorable weather, abundant fish, and safe journeys at sea. It serves as a reminder of the close bond between the fishing community and the sea.",
        "category": "Festival",
        "link": "https://anchoikhapchon.com/discover-the-famous-nghinh-ong-festival-in-can-gio/?lang=en",
        "youtube_url": "https://www.youtube.com/watch?v=QuQHBQ33m88&ab_channel=StreetFoodAndTravel"
    }
]
