[
    {
        "name": "Bitexco Financial Tower",
        "address": "02 Hai Trieu, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.771906645288361,
            106.70432225111162
        ],
        "ratings": 4.5,
        "total_ratings": 18043,
        "entrance_fee": "Free",
        "opening_hours": "8:00 AM - 11:00 PM",
        "short_description": "One of the highest skyscrapers in Vietnam with 68 floors",
        "full_description": "Bitexco Financial Tower, an architectural marvel and a symbol of modernity, proudly stands as one of Vietnam's most iconic skyscrapers. Located in the heart of Ho Chi Minh City, this impressive structure soars into the sky, dominating the city's skyline with its striking design and towering height.\n\nCompleted in 2010, the Bitexco Financial Tower is a testament to Vietnam's rapid development and progress on the global stage. Rising to a height of 262 meters (861 feet) with 68 floors, it claims the title of the tallest building in Vietnam and holds the distinction of being the 8th tallest building in the world.\n\nInspired by the delicate beauty of the lotus flower, a cherished symbol in Vietnamese culture, the tower's architecture reflects a sense of determination and positive energy. Its sleek and modern facade, clad in glass and aluminum, exudes elegance and sophistication.",
        "image_url": "bitexco",
        "popular_activities": [
            "Observation Deck",
            "Restaurants",
            "Skydeck",
            "Shopping"
        ],
        "nearby_activities": [
            {
                "event_name": "Saigon Skydeck",
                "image_url": "eye.fill",
                "ratings": 4.4,
                "fee": "200.000 VND"
            },
            {
                "event_name": "Dinner at EON51 Restaurant",
                "image_url": "fork.knife",
                "ratings": 4.6,
                "fee": "1.000.000 VND"
            }
        ],
        "category": "Landmarks",
        "reviews": [
            {
                "reviewer_name": "Quoc Doan",
                "given_stars": 5,
                "content": "Nice place. Cool!",
                "timestamp": "26/07/2022"
            },
            {
                "reviewer_name": "Nhat Anh",
                "given_stars": 4,
                "content": "Too hot but the architecture looks great",
                "timestamp": "02/09/2018"
            }
        ],
        "pictures": [
            "bitexco1",
            "bitexco2",
            "bitexco3",
            "bitexco4",
            "bitexco5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=O_ckK7Hxlrk&ab_channel=WanderlustTravelVideos",
        "website_url": "https://bitexco.com.vn/en/"
    },
    {
        "name": "Landmark 81",
        "address": "720A Dien Bien Phu, Vinhomes Central Park, Binh Thanh District, Ho Chi Minh City, Vietnam",
        "location": [
            10.795203968767177,
            106.72180003838334
        ],
        "ratings": 4.6,
        "total_ratings": 5050,
        "entrance_fee": "Free",
        "opening_hours": "8:30 AM - 11:00 PM",
        "short_description": "A Skyward Marvel in Vietnam and the World",
        "full_description": "The Landmark 81 is an impressive skyscraper that stands tall in Vietnam's bustling city. It proudly holds the title of the country's tallest building and ranks among the top eight tallest buildings in the world. With its remarkable architecture and design, it reflects the nation's ambition and progress.\n\nOver the years, The Landmark 81 has gained recognition for its outstanding features. It offers a stunning sky view of the city, making it a favorite spot for visitors. Inside, it houses the largest indoor ice skating rink, providing fun and entertainment for all.\n\nThe building is also known for its luxury offerings and excellent amenities. It caters to those seeking a lavish living experience, ensuring they have everything they need for a comfortable and sophisticated lifestyle.",
        "image_url": "landmark81",
        "popular_activities": [
            "Observation Deck",
            "Shopping",
            "Restaurants"
        ],
        "nearby_activities": [
            {
                "event_name": "Vinhomes Central Park",
                "image_url": "leaf.fill",
                "ratings": 4.5,
                "fee": "Free"
            }
        ],
        "category": "Landmarks",
        "reviews": [
            {
                "reviewer_name": "Quoc Minh",
                "given_stars": 5,
                "content": "It's hugeeeeeee",
                "timestamp": "02/09/2018"
            },
            {
                "reviewer_name": "Minh Bui",
                "given_stars": 5,
                "content": "The park around it looks clean and fresh tho.",
                "timestamp": "05/09/2018"
            },
            {
                "reviewer_name": "Nhat Long",
                "given_stars": 5,
                "content": "Definitely will go again!",
                "timestamp": "05/05/2022"
            }
        ],
        "pictures": [
            "landmark811",
            "landmark812",
            "landmark813",
            "landmark814",
            "landmark815"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=W3rNwp48jiU&ab_channel=MrABroad",
        "website_url": "https://www.landmark81skyview.com/"
    },
    {
        "name": "Ben Thanh Market",
        "address": "Le Loi Street, Ben Thanh Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.772590540423925,
            106.69802076861272
        ],
        "ratings": 3.9,
        "total_ratings": 46654,
        "entrance_fee": "Free",
        "opening_hours": "6:00 AM - 6:00 PM",
        "short_description": "One of the earliest buildings in Vietnam and has been the icon of the city since then",
        "full_description": "Ben Thanh Market, an iconic landmark and bustling marketplace in the heart of Ho Chi Minh City, Vietnam, has been an integral part of the city's history and culture for centuries. This age-old treasure stands as a testament to the enduring spirit of the Vietnamese people and serves as a vibrant hub of commerce and cultural exchange.\n\nLocated at the intersection of Le Loi, Ham Nghi, Tran Hung Dao, and Le Lai streets, the market is easily recognizable by its striking clock tower, which has become a symbol of Saigon's dynamic energy. As the sun rises, the market comes alive with a flurry of activity, with vendors setting up their stalls and eager shoppers exploring the vast array of goods on display.\n\nBen Thanh Market offers a delightful sensory experience, with its vibrant colors, tantalizing aromas, and lively sounds. Inside, you'll find a treasure trove of local handicrafts, clothing, textiles, jewelry, souvenirs, and fresh produce. The market is divided into various sections, each specializing in different products, ensuring there's something for everyone.",
        "image_url": "chobenthanh",
        "popular_activities": [
            "Shopping",
            "Street Food",
            "Souvenirs",
            "Local Crafts"
        ],
        "nearby_activities": [
            {
                "event_name": "Mariamman Hindu Temple",
                "image_url": "cross.fill",
                "ratings": 4.7,
                "fee": "Free"
            },
            {
                "event_name": "Saigon Central Post Office",
                "image_url": "envelope.fill",
                "ratings": 4.5,
                "fee": "20.000 VND"
            }
        ],
        "category": "Markets",
        "reviews": [
            {
                "reviewer_name": "Jane",
                "given_stars": 4,
                "content": "Very local, very saigon. But you gotta know how to bargain",
                "timestamp": "01/02/2018"
            },
            {
                "reviewer_name": "Tom Cruise",
                "given_stars": 3,
                "content": "The prices seems to be higher to foreigners, don't know why",
                "timestamp": "05/09/2016"
            },
            {
                "reviewer_name": "Nhat Quang",
                "given_stars": 5,
                "content": "Now i know that they do support money exchange. The rate is good",
                "timestamp": "07/05/2023"
            }
        ],
        "pictures": [
            "chobenthanh1",
            "chobenthanh2",
            "chobenthanh3",
            "chobenthanh4",
            "chobenthanh5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=Q4ZANPEcsxM&ab_channel=TRAVELVIETNAM4K",
        "website_url": "https://www.ben-thanh-market.com"
    },
    {
        "name": "War Remnants Museum",
        "address": "28 Vo Van Tan, Ward 6, District 3, Ho Chi Minh City, Vietnam",
        "location": [
            10.779710840089733,
            106.69209159529221
        ],
        "ratings": 4.5,
        "total_ratings": 29094,
        "entrance_fee": "40.000 VND",
        "opening_hours": "7:30 AM - 5:30 PM",
        "short_description": "A member of the International Network of Peace Museums",
        "full_description": "The War Remnants Museum, located in Ho Chi Minh City, Vietnam, stands as a poignant testament to the harrowing realities of the Vietnam War. Formerly known as the 'Exhibition House for US and Puppet Crimes' the museum is a must-visit for those seeking to understand the war's impact on Vietnam and its people.\n\nAs visitors step into the museum, they are immersed in a chronicle of the war's history, depicted through an extensive collection of photographs, artifacts, and exhibits. The photographs, captured by renowned war photographers, provide a haunting visual narrative of the war's atrocities, showcasing the human toll and the devastating effects on the lives of Vietnamese civilians and soldiers.",
        "image_url": "warmuseum",
        "popular_activities": [
            "History Exhibits",
            "Photography",
            "Outdoor Displays"
        ],
        "nearby_activities": [
            {
                "event_name": "Independence Palace",
                "image_url": "building.2.fill",
                "ratings": 4.4,
                "fee": "40.000 VND"
            },
            {
                "event_name": "Ho Chi Minh City Museum",
                "image_url": "building.columns.fill",
                "ratings": 4.2,
                "fee": "Free"
            }
        ],
        "category": "Museums",
        "reviews": [
            {
                "reviewer_name": "Linh Nguyen",
                "given_stars": 5,
                "content": "A deeply moving experience that sheds light on the horrors of war. The museum's exhibits are powerful and thought-provoking.",
                "timestamp": "05/12/2022"
            },
            {
                "reviewer_name": "James Johnson",
                "given_stars": 3,
                "content": "While informative, the displays can be distressing for some visitors. Not recommended for young children.",
                "timestamp": "19/08/2023"
            }
        ],
        "pictures": [
            "warmuseum1",
            "warmuseum2",
            "warmuseum3",
            "warmuseum4",
            "warmuseum5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=9GzYNlG31v8&ab_channel=MichelePonte",
        "website_url": "https://baotangchungtichchientranh.vn/?language=en"
    },
    {
        "name": "Central Post Office",
        "address": "02 Paris Commune Street, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.780176349531281,
            106.69976249374433
        ],
        "ratings": 4.5,
        "total_ratings": 3651,
        "entrance_fee": "Free",
        "opening_hours": "7:30 AM - 6:00 PM",
        "short_description": "An iconic French-inspired historical building in Saigon",
        "full_description": "As visitors step inside the Central Post Office, they are greeted by the soaring arched ceilings and the sight of the meticulously crafted interior. The large portrait of Ho Chi Minh, a beloved figure in Vietnam's history, adorns the walls, reminding everyone of the nation's resilience and unity. The post office's bustling atmosphere, filled with people mailing letters and packages, blends harmoniously with the whispers of history that echo through the halls. From the ornate telephone booths to the vintage maps and clocks, every corner tells a story of the past, creating a sense of wonder and nostalgia. The Central Post Office stands not only as a functional hub for communication but also as a timeless tribute to the enduring spirit of Saigon, preserving its heritage for generations to come.",
        "image_url": "postoffice",
        "popular_activities": [
            "Architecture",
            "History Exhibits",
            "Photography"
        ],
        "nearby_activities": [
            {
                "event_name": "Saigon Notre-Dame Basilica",
                "image_url": "cross.fill",
                "ratings": 4.5,
                "fee": "Free"
            },
            {
                "event_name": "Independence Palace",
                "image_url": "building.2.fill",
                "ratings": 4.4,
                "fee": "40.000 VND"
            }
        ],
        "category": "Historical Buildings",
        "reviews": [
            {
                "reviewer_name": "John Doe",
                "given_stars": 4,
                "content": "Really cool old building! Loved the vintage vibes and took some great selfies here. It's a nice break from the busy streets outside.",
                "timestamp": "06/10/2023"
            },
            {
                "reviewer_name": "Jane Smith",
                "given_stars": 5,
                "content": "WOW! This post office is like a work of art. Soaring ceilings and beautiful architecture. Sending postcards from here was fun!",
                "timestamp": "12/09/2023"
            },
            {
                "reviewer_name": "Bob Nguyen",
                "given_stars": 3,
                "content": "Not gonna lie, it's pretty, but way too crowded for me. Hard to find a quiet spot to appreciate the history.",
                "timestamp": "03/11/2023"
            },
            {
                "reviewer_name": "Samantha Lee",
                "given_stars": 5,
                "content": "I'm in love with this post office! If I ever wanted to feel like I'm in a fairytale, this is the place. Instagrammable AF!",
                "timestamp": "19/08/2023"
            },
            {
                "reviewer_name": "Michael Wang",
                "given_stars": 4,
                "content": "Impressive architecture and the atmosphere inside is bustling. Highly recommend checking it out! PS: Postcards make great souvenirs.",
                "timestamp": "02/10/2023"
            }
        ],
        "pictures": [
            "postoffice1",
            "postoffice2",
            "postoffice3",
            "postoffice4",
            "postoffice5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=jCayjSVzfrI&ab_channel=PopHeyHey",
        "website_url": "http://hcmpost.vn/"
    },
    {
        "name": "Saigon Opera House",
        "address": "07 Cong Truong Lam Son, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.776877600445069,
            106.70315466645607
        ],
        "ratings": 4.5,
        "total_ratings": 11919,
        "entrance_fee": "700.000 VND",
        "opening_hours": "8:00 AM - 5:00 PM",
        "short_description": "Immerse yourself in a classical atmosphere amidst the modernity of Saigon",
        "full_description": "The Saigon Opera House is a magnificent gem that embraces elegance and sophistication. Built in the late 19th century, it stands as a historic cultural landmark and hosts a myriad of captivating performances, from traditional Vietnamese opera to contemporary shows.\n\nWith its grand facade and ornate architecture, the Opera House exudes an air of timeless beauty, drawing art enthusiasts and curious onlookers alike. The stage inside becomes a canvas for artistic expressions, where tales of love, heroism, and drama come to life, leaving audiences spellbound. Whether you are a local or a traveler passing through, the Saigon Opera House invites you to immerse yourself in the magic of the performing arts, creating cherished memories that resonate long after the curtains close.",
        "image_url": "saigonoperahouse",
        "popular_activities": [
            "Architecture",
            "Performing Arts",
            "Opera Shows"
        ],
        "nearby_activities": [
            {
                "event_name": "Ho Chi Minh City Hall",
                "image_url": "building.fill",
                "ratings": 4.5,
                "fee": "Free"
            },
            {
                "event_name": "Bitexco Financial Tower",
                "image_url": "building.fill",
                "ratings": 4.5,
                "fee": "Free"
            }
        ],
        "category": "Theaters",
        "reviews": [
            {
                "reviewer_name": "Alice Johnson",
                "given_stars": 5,
                "content": "Attended a live show here, and it was incredible! The architecture is stunning, and the performances are top-notch. A must-visit in Saigon!",
                "timestamp": "07/10/2023"
            },
            {
                "reviewer_name": "David Lee",
                "given_stars": 4,
                "content": "Beautiful French colonial building with a touch of Vietnamese culture. Enjoyed the evening vibes around the opera house. Great for photos!",
                "timestamp": "15/09/2023"
            },
            {
                "reviewer_name": "Emily Chen",
                "given_stars": 3,
                "content": "It's a historical icon, but I expected more from the inside. I guess it's better to catch a show here to fully appreciate it.",
                "timestamp": "28/11/2023"
            }
        ],
        "pictures": [
            "saigonoperahouse1",
            "saigonoperahouse2",
            "saigonoperahouse3",
            "saigonoperahouse4",
            "saigonoperahouse5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=PTzW2dSCqBc&ab_channel=BubbleNomad",
        "website_url": "https://www.luneproduction.com/saigon-opera-house"
    },
    {
        "name": "Walking Street",
        "address": "Nguyen Hue Walking Street, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.774253064345054,
            106.70365918256074
        ],
        "ratings": 4.7,
        "total_ratings": 266,
        "entrance_fee": "Free",
        "opening_hours": "24/7",
        "short_description": "A famous walking route within the heart of the city",
        "full_description": "Nguyen Hue Walking Street is a vibrant and bustling pedestrian promenade located in the heart of Ho Chi Minh City, Vietnam. Stretching from the iconic Saigon City Hall to the Saigon River, this picturesque street is a favorite gathering spot for both locals and tourists.\n\nThe walking street is named after Nguyen Hue, a famous Vietnamese military commander, and is a symbol of the city's rich history and culture. Lined with majestic trees and colorful flower beds, the street exudes a lively and welcoming ambiance. It serves as a central hub for various social activities and events, making it a popular destination for people of all ages.\n\nThroughout the day, Nguyen Hue Walking Street teems with activity. As the sun sets, the street comes alive with dazzling lights that illuminate the entire area, creating a magical atmosphere. Local artists and performers showcase their talents, entertaining the crowds with traditional music, dance performances, and other cultural displays.",
        "image_url": "walkingstreet",
        "popular_activities": [
            "Nightlife",
            "Street Performances",
            "Street Food"
        ],
        "nearby_activities": [
            {
                "event_name": "Saigon River Cruise",
                "image_url": "sailboat.fill",
                "ratings": 4.5,
                "fee": "300.000 VND"
            }
        ],
        "category": "Streets",
        "reviews": [
            {
                "reviewer_name": "John Smith",
                "given_stars": 5,
                "content": "Love this vibrant walking street! There's always something exciting happening here - street performances, food stalls, and a lively atmosphere. Perfect for an evening hangout!",
                "timestamp": "12/07/2023"
            },
            {
                "reviewer_name": "Lisa Nguyen",
                "given_stars": 4,
                "content": "Nguyen Hue is a great place to take a stroll and enjoy the city vibes. I especially like the light displays at night. Very picturesque!",
                "timestamp": "28/06/2023"
            },
            {
                "reviewer_name": "Michael Johnson",
                "given_stars": 3,
                "content": "It's a popular spot for tourists, but it gets too crowded sometimes. The street vendors are a bit pushy. Visit on weekdays for a better experience.",
                "timestamp": "05/08/2023"
            }
        ],
        "pictures": [
            "walkingstreet1",
            "walkingstreet2",
            "walkingstreet3",
            "walkingstreet4",
            "walkingstreet5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=pOYJ13nDW1c&ab_channel=SlowWalks",
        "website_url": "https://vinwonders.com/en/news/nguyen-hue-street-enjoy-the-walk-of-your-life-in-the-center-of-saigon/"
    },
    {
        "name": "Saigon Notre-Dame Cathedral",
        "address": "01 Paris Commune Street, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.779964660905268,
            106.69891160693115
        ],
        "ratings": 4.5,
        "total_ratings": 21192,
        "entrance_fee": "Free",
        "opening_hours": "6:00 AM - 7:00 PM",
        "short_description": "A noble symbol of Catholicism in Vietnam",
        "full_description": "The Notre-Dame Cathedral Basilica of Saigon, located in the heart of Ho Chi Minh City (formerly known as Saigon), Vietnam, is an exquisite masterpiece of architecture and a significant religious landmark in the country. Also known as Saigon Notre-Dame Cathedral, it stands as a symbol of faith, history, and French colonial influence in Vietnam.\n\nConstructed between 1863 and 1880 during the French colonial period, the cathedral was inspired by the iconic Notre-Dame de Paris in France. Its imposing facade, built with red bricks brought from France, showcases twin bell towers that soar majestically into the sky, reaching a height of about 58 meters (190 feet). The exterior is adorned with beautiful sculptures and delicate stained glass windows, adding to its grandeur and allure.\n\nThroughout its history, the cathedral has witnessed significant events, including religious ceremonies, state functions, and moments of historical importance. It has stood as a witness to the changing tides of Vietnam's history and continues to be a place of prayer and worship for the Catholic community.",
        "image_url": "nhathoducba",
        "popular_activities": [
            "Architecture",
            "Religious Services",
            "Photography"
        ],
        "nearby_activities": [
            {
                "event_name": "Central Post Office",
                "image_url": "signpost.right.fill",
                "ratings": 4.5,
                "fee": "20.000 VND"
            },
            {
                "event_name": "Saigon Central Book Street",
                "image_url": "book.fill",
                "ratings": 4.6,
                "fee": "Free"
            }
        ],
        "category": "Religious Sites",
        "reviews": [
            {
                "reviewer_name": "Emma Johnson",
                "given_stars": 5,
                "content": "Wow, what a magnificent cathedral! The architecture is stunning, and the interior is so peaceful. A must-visit in the heart of the city.",
                "timestamp": "17/09/2023"
            },
            {
                "reviewer_name": "Alex Nguyen",
                "given_stars": 4,
                "content": "Impressive historical building with beautiful stained glass windows. It can get crowded, but it's worth seeing. I recommend going early to avoid the tourist rush!",
                "timestamp": "02/08/2023"
            },
            {
                "reviewer_name": "Sophia Lee",
                "given_stars": 3,
                "content": "The cathedral is a symbol of history, but it's under renovation now, so part of it was covered. Kinda disappointed, but I guess it's necessary.",
                "timestamp": "12/10/2023"
            }
        ],
        "pictures": [
            "nhathoducba1",
            "nhathoducba2",
            "nhathoducba3",
            "nhathoducba4",
            "nhathoducba5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=R2PVLDHY8z0&ab_channel=VietPrestigeTravel",
        "website_url": "https://vietnamtravel.com/notre-dame-cathedral-of-saigon-things-to-know/"
    },
    {
        "name": "Bui Vien Street",
        "address": "Bui Vien Street, Pham Ngu Lao Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.767602268273274,
            106.69403341063634
        ],
        "ratings": 4.3,
        "total_ratings": 11914,
        "entrance_fee": "Free",
        "opening_hours": "24/7",
        "short_description": "Experience the vibrant nightlife of Saigon, a city that never sleeps",
        "full_description": "Bui Vien Walking Street, situated in the heart of Ho Chi Minh City's bustling District 1, is a vibrant and lively hub that offers an unforgettable experience for both locals and tourists alike. Stretching along Bui Vien Street and its adjacent alleys, this popular destination has earned its reputation as the 'backpacker's area' due to its appeal to international travelers seeking a taste of the city's vibrant nightlife and cultural diversity.\n\nAs the sun sets, Bui Vien Walking Street comes alive with a kaleidoscope of colors, sounds, and aromas. The street is lined with a plethora of restaurants, bars, cafes, and street food stalls, offering a delightful range of Vietnamese and international cuisines. From savoring the rich flavors of traditional pho and banh mi to indulging in Western dishes and exotic delicacies, there's something to tantalize every palate.",
        "image_url": "buivien",
        "popular_activities": [
            "Nightlife",
            "Bars",
            "Street Food"
        ],
        "nearby_activities": [
            {
                "event_name": "Ben Thanh Market",
                "image_url": "building.fill",
                "ratings": 4.0,
                "fee": "Free"
            }
        ],
        "category": "Streets",
        "reviews": [
            {
                "reviewer_name": "Hoa Nguyen",
                "given_stars": 4,
                "content": "There are many bars and delicious restaurants on Bui Vien Street. So much fun!",
                "timestamp": "25/07/2023"
            },
            {
                "reviewer_name": "Thang Le",
                "given_stars": 5,
                "content": "Bui Vien Street is the heart of vibrant parties! Enjoyed hopping from one bar to another and trying various Vietnamese beers. The street food here is also amazing. Highly recommended!",
                "timestamp": "01/08/2023"
            },
            {
                "reviewer_name": "Phuong Tran",
                "given_stars": 3,
                "content": "It's a bustling street with many entertainment options, but it's too crowded for my liking. Prices can be higher for tourists too.",
                "timestamp": "12/09/2023"
            },
            {
                "reviewer_name": "Quoc Nguyen",
                "given_stars": 4,
                "content": "Had a fantastic night exploring Bui Vien Street. The live music and friendly atmosphere in every corner were incredible. Don't miss trying the grilled street food!",
                "timestamp": "06/10/2023"
            }
        ],
        "pictures": [
            "buivien1",
            "buivien2",
            "buivien3",
            "buivien4",
            "buivien5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=MIQ2VCKXFY8&ab_channel=4KWalking",
        "website_url": "https://vietnamdiscovery.com/ho-chi-minh-city/attractions/bui-vien-street/"
    },
    {
        "name": "Dam Sen Water Park",
        "address": "03 Hoa Binh, Ward 3, District 11, Ho Chi Minh City, Vietnam",
        "location": [
            10.769063327514173,
            106.63595097994772
        ],
        "ratings": 4.3,
        "total_ratings": 28128,
        "entrance_fee": "280.000 VND",
        "opening_hours": "8:30 AM - 6:00 PM",
        "short_description": "A famous water park in Ho Chi Minh City.",
        "full_description": "Dam Sen Water Park is a cherished oasis of fun and relaxation nestled in the bustling city of Ho Chi Minh, Vietnam. A beloved destination for families, friends, and thrill-seekers, it promises an unforgettable experience filled with joy and excitement.\n\nAs you step into Dam Sen Water Park, you are greeted by a vibrant world of aquatic wonders. The park boasts a myriad of water-based activities, perfect for beating the tropical heat. Adventurers can indulge in thrilling water slides that twist and turn, offering heart-pounding moments of exhilaration. The lazy rivers gently carry visitors on a soothing journey through lush greenery, providing a tranquil escape from the city's hustle and bustle.\n\nThe refreshing pools at Dam Sen Water Park invite guests to dive into a refreshing aquatic paradise. Whether you're a skilled swimmer or just looking to relax, the pools cater to every preference. Families can splash around in the shallow areas, creating cherished memories with their little ones.",
        "image_url": "damsen",
        "popular_activities": [
            "Water Slides",
            "Wave Pools",
            "Lazy River"
        ],
        "nearby_activities": [
            {
                "event_name": "Ho Chi Minh City Children's Cultural House for Youth",
                "image_url": "studentdesk",
                "ratings": 4.4,
                "fee": "20.000 VND"
            }
        ],
        "category": "Parks",
        "reviews": [
            {
                "reviewer_name": "Huyen Nguyen",
                "given_stars": 4,
                "content": "Dam Sen Water Park is a great place to cool off and have fun with family and friends. The water slides are thrilling!",
                "timestamp": "25/07/2023"
            },
            {
                "reviewer_name": "Anh Tran",
                "given_stars": 5,
                "content": "I had a fantastic time at Dam Sen Water Park. The wave pool and lazy river were so enjoyable!",
                "timestamp": "01/08/2023"
            },
            {
                "reviewer_name": "Minh Hoang",
                "given_stars": 3,
                "content": "Dam Sen Water Park is fun, but it can get crowded on weekends. Consider visiting on a weekday.",
                "timestamp": "12/09/2023"
            },
            {
                "reviewer_name": "Tien Le",
                "given_stars": 4,
                "content": "The water park is well-maintained and clean. It's a perfect place to spend a hot summer day!",
                "timestamp": "06/10/2023"
            }
        ],
        "pictures": [
            "damsen1",
            "damsen2",
            "damsen3",
            "damsen4",
            "damsen5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=kTmc65KclPg&ab_channel=NEXT%2FCharl%26Christine",
        "website_url": "https://www.damsenwaterpark.com.vn/"
    },
    {
        "name": "Independence Palace",
        "address": "135 Nam Ky Khoi Nghia, Ben Thanh Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.77720498136426,
            106.69537719714477
        ],
        "ratings": 4.7,
        "total_ratings": 21409,
        "entrance_fee": "40.000 VND",
        "opening_hours": "7:30 AM - 5:00 PM",
        "short_description": "A symbol of peace and national unity",
        "full_description": "Independence Palace, also known as Reunification Palace, is an iconic historical landmark situated in Ho Chi Minh City, Vietnam. It holds deep significance as the site where pivotal events in Vietnam's history unfolded, leading to the reunification of North and South Vietnam.\n\nOriginally constructed as the Norodom Palace during the French colonial era, the building's construction began in 1868 and was completed in 1873. However, the palace underwent significant renovations and expansions in the following years, culminating in its current form, which was completed in 1966.\n\nThe architecture of Independence Palace blends modernist elements with traditional Vietnamese design, creating a unique and captivating visual appeal. The sprawling compound features spacious gardens, elegant corridors, and ceremonial halls, exuding a sense of grandeur and authority.",
        "image_url": "dinhdoclap",
        "popular_activities": [
            "Architecture",
            "History Exhibits",
            "Photography"
        ],
        "nearby_activities": [
            {
                "event_name": "War Remnants Museum",
                "image_url": "flame.fill",
                "ratings": 4.5,
                "fee": "40.000 VND"
            },
            {
                "event_name": "Central Post Office",
                "image_url": "signpost.right.fill",
                "ratings": 4.5,
                "fee": "20.000 VND"
            }
        ],
        "category": "Historical Buildings",
        "reviews": [
            {
                "reviewer_name": "Phuong Tran",
                "given_stars": 5,
                "content": "The Independence Palace is a historical gem! The guided tour was informative, and the architecture is stunning.",
                "timestamp": "25/07/2023"
            },
            {
                "reviewer_name": "Hieu Nguyen",
                "given_stars": 4,
                "content": "A must-visit landmark in Ho Chi Minh City. The palace grounds are spacious, and the history is fascinating.",
                "timestamp": "10/08/2023"
            },
            {
                "reviewer_name": "Linh Vo",
                "given_stars": 3,
                "content": "The Independence Palace is significant, but I wish there were more interactive exhibits.",
                "timestamp": "15/09/2023"
            }
        ],
        "pictures": [
            "dinhdoclap1",
            "dinhdoclap2",
            "dinhdoclap3",
            "dinhdoclap4",
            "dinhdoclap5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=18mXLVtL7Tk&ab_channel=JayRuleProductionsðŸŽ¬",
        "website_url": "https://independencepalace.gov.vn/"
    },
    {
        "name": "Saigon Central Book Street",
        "address": "Nguyen Van Binh Street, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.781149360198778,
            106.69996752042294
        ],
        "ratings": 4.6,
        "total_ratings": 1077,
        "entrance_fee": "Free",
        "opening_hours": "8:00 AM - 10:00 PM",
        "short_description": "A dream destination for book enthusiasts",
        "full_description": "Central Book Street, a literary haven nestled in the heart of the city, is a beloved destination for book enthusiasts and casual readers alike. Located in the bustling downtown area, this enchanting street is dedicated to the world of books, fostering a vibrant literary culture and celebrating the written word.\n\nLined with charming bookshops, cozy cafes, and inviting reading corners, Central Book Street offers a unique and immersive experience for bibliophiles. As you stroll along the cobblestone pathways, the rich aroma of freshly printed books fills the air, enticing you to explore the treasures that lie within.\n\nAt the heart of Central Book Street, a picturesque square serves as a hub of cultural activities and book-related events. Authors' book signings, poetry readings, and book fairs are just a few of the enchanting happenings that breathe life into this literary oasis.",
        "image_url": "bookstreet",
        "popular_activities": [
            "Book Shopping",
            "Book Signing Events",
            "Literary Events"
        ],
        "nearby_activities": [
            {
                "event_name": "Saigon Notre-Dame Cathedral",
                "image_url": "cross.fill",
                "ratings": 4.5,
                "fee": "Free"
            },
            {
                "event_name": "Central Post Office",
                "image_url": "signpost.right.fill",
                "ratings": 4.5,
                "fee": "20.000 VND"
            }
        ],
        "category": "Streets",
        "reviews": [
            {
                "reviewer_name": "Thien Pham",
                "given_stars": 4,
                "content": "I loved strolling along Saigon Central Book Street. So many books to explore and cozy cafes to read in!",
                "timestamp": "18/07/2023"
            },
            {
                "reviewer_name": "Trang Nguyen",
                "given_stars": 3,
                "content": "Saigon Central Book Street is charming, but the book prices are a bit higher than regular bookstores.",
                "timestamp": "05/08/2023"
            }
        ],
        "pictures": [
            "bookstreet1",
            "bookstreet2",
            "bookstreet3",
            "bookstreet4",
            "bookstreet5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=hVS5r-2TkCo&ab_channel=MaxJavon",
        "website_url": "https://vinpearl.com/en/ho-chi-minh-city-book-street-pinpoint-the-paradise-for-bookworms"
    },
    {
        "name": "Saigon Zoo and Botanical Gardens",
        "address": "02 Nguyen Binh Khiem, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.787754173963279,
            106.70525840878398
        ],
        "ratings": 4.2,
        "total_ratings": 26122,
        "entrance_fee": "50.000 VND",
        "opening_hours": "7:00 AM - 5:30 PM",
        "short_description": "An oasis of nature in the heart of the city",
        "full_description": "Saigon Zoo and Botanical Garden, nestled in the heart of Ho Chi Minh City, Vietnam, is a captivating oasis of natural beauty and wildlife wonders. Established in 1865, it holds the distinction of being the oldest zoo in the country and has since become a beloved destination for locals and tourists seeking a respite from the bustling city.\n\nSpread across a sprawling expanse, the zoo and botanical garden offer a delightful escape into the wonders of the animal kingdom and the lush embrace of nature. As you wander through its verdant pathways, you are greeted by a diverse array of flora and fauna, showcasing the rich biodiversity of Vietnam and beyond.\n\nThe botanical garden enchants visitors with its carefully curated collection of plants, trees, and flowers from various regions, creating a mesmerizing tapestry of colors and fragrances. Rare and exotic species coexist alongside native plants, creating a harmonious sanctuary for nature enthusiasts and botany aficionados.",
        "image_url": "saigonzoo",
        "popular_activities": [
            "Animal Watching",
            "Picnics",
            "Botanical Exploration"
        ],
        "nearby_activities": [
            {
                "event_name": "Ho Chi Minh City Museum of Fine Arts",
                "image_url": "paintpalette.fill",
                "ratings": 4.3,
                "fee": "30.000 VND"
            },
            {
                "event_name": "History Museum",
                "image_url": "book.fill",
                "ratings": 4.4,
                "fee": "30.000 VND"
            }
        ],
        "category": "Parks",
        "reviews": [
            {
                "reviewer_name": "Dat Le",
                "given_stars": 5,
                "content": "Saigon Zoo and Botanical Garden is a delightful place for a family outing. Kids will love seeing the animals!",
                "timestamp": "29/07/2023"
            },
            {
                "reviewer_name": "Thu Phan",
                "given_stars": 4,
                "content": "I had a wonderful time at the zoo. The botanical garden is a peaceful oasis in the middle of the city.",
                "timestamp": "02/08/2023"
            },
            {
                "reviewer_name": "Hoa Tran",
                "given_stars": 5,
                "content": "Saigon Zoo and Botanical Garden is well-maintained, and the variety of plant species is impressive.",
                "timestamp": "09/09/2023"
            },
            {
                "reviewer_name": "Thang Vo",
                "given_stars": 4,
                "content": "The zoo is fantastic! Just be prepared for the hot weather and bring plenty of water.",
                "timestamp": "16/09/2023"
            },
            {
                "reviewer_name": "Nga Nguyen",
                "given_stars": 3,
                "content": "The zoo is enjoyable, but some enclosures could be larger for the animals' well-being.",
                "timestamp": "24/09/2023"
            }
        ],
        "pictures": [
            "saigonzoo1",
            "saigonzoo2",
            "saigonzoo3",
            "saigonzoo4",
            "saigonzoo5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=qBQwylTI4gA&ab_channel=MrCrazySmile",
        "website_url": "https://saigonzoo.net/"
    },
    {
        "name": "Ho Chi Minh City Museum of Fine Arts",
        "address": "97A Pho Duc Chinh, Nguyen Thai Binh Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.77023884490251,
            106.69897602042288
        ],
        "ratings": 4.3,
        "total_ratings": 6727,
        "entrance_fee": "30.000 VND",
        "opening_hours": "8:00 AM - 5:00 PM",
        "short_description": "An exquisite collection of artistic masterpieces",
        "full_description": "The Ho Chi Minh City Museum of Fine Arts, situated in the heart of bustling Ho Chi Minh City, Vietnam, is a cultural gem that showcases the country's rich artistic heritage. Housed in an elegant colonial-era building, the museum itself is a work of art and a testament to the city's historical charm.\n\nUpon entering the museum, visitors are greeted with a diverse collection of artworks spanning various periods, styles, and mediums. From traditional Vietnamese paintings, sculptures, and lacquerware to contemporary art and modern installations, the museum offers a comprehensive and immersive journey through the evolution of Vietnamese art.\n\nThe museum's exhibits provide a glimpse into the country's artistic traditions, reflecting its cultural diversity and the fusion of Eastern and Western influences. Visitors can marvel at intricate silk paintings depicting scenes of daily life, ancient ceramics adorned with exquisite patterns, and delicate woodcarvings that showcase the skill of Vietnamese artisans.",
        "image_url": "finearts",
        "popular_activities": [
            "Art Appreciation",
            "Exhibitions",
            "Workshops"
        ],
        "nearby_activities": [
            {
                "event_name": "Saigon Central Post Office",
                "image_url": "envelope.fill",
                "ratings": 4.5,
                "fee": "Free"
            },
            {
                "event_name": "Saigon Opera House",
                "image_url": "music.note",
                "ratings": 4.5,
                "fee": "700.000 VND"
            }
        ],
        "category": "Museums",
        "reviews": [
            {
                "reviewer_name": "Hien Bui",
                "given_stars": 3,
                "content": "The Museum of Fine Arts has a decent collection, but it lacks some famous artworks I expected to see.",
                "timestamp": "10/08/2023"
            },
            {
                "reviewer_name": "Khanh Nguyen",
                "given_stars": 4,
                "content": "I enjoyed my visit to the Museum of Fine Arts. It's a peaceful place to appreciate art.",
                "timestamp": "16/08/2023"
            },
            {
                "reviewer_name": "Lan Vo",
                "given_stars": 3,
                "content": "The museum has some beautiful pieces, but I wish there were more English descriptions.",
                "timestamp": "22/08/2023"
            }
        ],
        "pictures": [
            "finearts1",
            "finearts2",
            "finearts3",
            "finearts4",
            "finearts5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=sZz41_ahWvo&ab_channel=JayRuleProductionsðŸŽ¬",
        "website_url": "http://baotangmythuattphcm.com.vn/"
    },
    {
        "name": "History Museum",
        "address": "02 Nguyen Binh Khiem, Ben Nghe Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.788099920725092,
            106.70483415481714
        ],
        "ratings": 4.4,
        "total_ratings": 2626,
        "entrance_fee": "30.000 VND",
        "opening_hours": "8:00 AM - 5:00 PM",
        "short_description": "A journey through Vietnam's fascinating history",
        "full_description": "The History Museum of Ho Chi Minh City, located in the heart of Vietnam's bustling metropolis, is a treasure trove of the nation's rich heritage and storied past. Housed within a grand neoclassical building that reflects its historical significance, the museum stands as a gateway to understanding the cultural evolution of this vibrant city and the entire country.\n\nThe museum's extensive collection spans thousands of years, showcasing artifacts and exhibits that highlight Vietnam's diverse history, from its ancient civilizations to the modern era. Visitors are taken on a captivating journey through time, exploring the rise and fall of dynasties, the influence of various cultures, and the resilience of the Vietnamese people.",
        "image_url": "historymuseum",
        "popular_activities": [
            "Historical Exhibits",
            "Cultural Artifacts",
            "Archaeological Discoveries"
        ],
        "nearby_activities": [
            {
                "event_name": "Ho Chi Minh City Museum of Fine Arts",
                "image_url": "paintpalette.fill",
                "ratings": 4.3,
                "fee": "30.000 VND"
            },
            {
                "event_name": "Saigon Opera House",
                "image_url": "music.note",
                "ratings": 4.5,
                "fee": "700.000 VND"
            }
        ],
        "category": "Museums",
        "reviews": [
            {
                "reviewer_name": "Long Nguyen",
                "given_stars": 4,
                "content": "The History Museum provides a fascinating insight into Vietnam's past. Don't miss the ancient artifacts!",
                "timestamp": "05/07/2023"
            },
            {
                "reviewer_name": "Thuy Tran",
                "given_stars": 5,
                "content": "I loved exploring the History Museum. Each exhibit is well-curated and educational.",
                "timestamp": "12/07/2023"
            },
            {
                "reviewer_name": "Phat Le",
                "given_stars": 4,
                "content": "The museum offers a rich history of Vietnam. I recommend hiring a guide for a better understanding.",
                "timestamp": "19/07/2023"
            }
        ],
        "pictures": [
            "historymuseum1",
            "historymuseum2",
            "historymuseum3",
            "historymuseum4",
            "historymuseum5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=Qm0WP5JPA20&ab_channel=Lo-FiTravel",
        "website_url": "http://www.baotanglichsutphcm.com.vn/en-US/Default.aspx"
    },
    {
        "name": "Giac Lam Pagoda",
        "address": "565 Lac Long Quan, Ward 10, Tan Binh District, Ho Chi Minh City, Vietnam",
        "location": [
            10.778838875405707,
            106.64927072197798
        ],
        "ratings": 4.6,
        "total_ratings": 3021,
        "entrance_fee": "Free",
        "opening_hours": "5:00 AM - 8:00 PM",
        "short_description": "The oldest pagoda in Ho Chi Minh City",
        "full_description": "Giac Lam Pagoda, an ancient and revered Buddhist temple, is a cultural and spiritual gem nestled within the bustling city of Ho Chi Minh City, Vietnam. With its origins dating back over three centuries, it stands as one of the oldest and most significant pagodas in the region, holding a cherished place in the hearts of locals and pilgrims alike.\n\nLocated in the Tan Binh District, the pagoda's serene and inviting atmosphere offers a respite from the urban clamor, providing a tranquil sanctuary for contemplation and prayer. As you approach the entrance, the intricate gate and imposing stone pillars welcome you into this sacred realm, where the essence of Buddhism permeates the air.\n\nThe pagoda's architectural design follows a blend of Chinese and Vietnamese influences, showcasing a distinctive blend of cultural traditions. Its ornate and colorful facade features splendidly crafted carvings and statues of Buddhist deities, dragons, and mythical creatures, each contributing to the pagoda's allure.",
        "image_url": "giaclam",
        "popular_activities": [
            "Religious Visits",
            "Cultural Insights",
            "Photography"
        ],
        "nearby_activities": [
            {
                "event_name": "Dam Sen Water Park",
                "image_url": "droplet.fill",
                "ratings": 4.3,
                "fee": "280.000 VND"
            }
        ],
        "category": "Religious Sites",
        "reviews": [
            {
                "reviewer_name": "Ngoc Truong",
                "given_stars": 3,
                "content": "Giac Lam Pagoda is a peaceful place, but it can get crowded with tourists.",
                "timestamp": "15/08/2023"
            },
            {
                "reviewer_name": "Minh Do",
                "given_stars": 4,
                "content": "I found the architecture and history of Giac Lam Pagoda intriguing. Worth a visit!",
                "timestamp": "22/08/2023"
            },
            {
                "reviewer_name": "Hai Huynh",
                "given_stars": 3,
                "content": "While the pagoda is beautiful, the surroundings are noisy due to nearby traffic.",
                "timestamp": "29/08/2023"
            }
        ],
        "pictures": [
            "giaclam1",
            "giaclam2",
            "giaclam3",
            "giaclam4",
            "giaclam5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=iEzzEke9wKA&ab_channel=For91DaysTravelBlog",
        "website_url": "https://localvietnam.com/blog/giac-lam-pagoda/"
    },
    {
        "name": "Crescent Mall",
        "address": "101 Ton Dat Tien, Tan Phu Ward, District 7, Ho Chi Minh City, Vietnam",
        "location": [
            10.728619881715586,
            106.71855569559195
        ],
        "ratings": 4.5,
        "total_ratings": 15050,
        "entrance_fee": "Free",
        "opening_hours": "10:00 AM - 10:00 PM",
        "short_description": "A modern shopping, dining and entertainment complex",
        "full_description": "A bustling destination that caters to the diverse needs and desires of locals and tourists alike. Situated in the Phu My Hung urban area, Crescent Mall has become an iconic landmark, drawing shoppers from all corners of the city.\n\nAs you step inside, you are greeted with a contemporary and spacious interior, designed to provide a pleasant and comfortable shopping experience. The mall boasts a wide array of retail stores, offering everything from high-end fashion brands to popular international and local labels. Fashion enthusiasts can explore the latest trends and styles, while those seeking unique souvenirs can find a variety of specialty shops.\n\nBeyond fashion, Crescent Mall is a haven for food lovers. Its extensive food court and a variety of restaurants offer a diverse range of cuisines, ranging from traditional Vietnamese delicacies to international flavors. Visitors can indulge in mouthwatering dishes while relishing the vibrant atmosphere of the mall.",
        "image_url": "crescentmall",
        "popular_activities": [
            "Shopping",
            "Dining",
            "Entertainment"
        ],
        "nearby_activities": [],
        "category": "Shopping",
        "reviews": [
            {
                "reviewer_name": "Trung Phan",
                "given_stars": 5,
                "content": "Crescent Mall is a fantastic shopping destination with a great variety of stores and restaurants.",
                "timestamp": "03/07/2023"
            },
            {
                "reviewer_name": "Bao Tran",
                "given_stars": 5,
                "content": "I had a wonderful time shopping and dining at Crescent Mall. It's modern and well-designed.",
                "timestamp": "09/07/2023"
            },
            {
                "reviewer_name": "Giang Le",
                "given_stars": 4,
                "content": "Crescent Mall is a shopper's paradise. Just be prepared for occasional crowds on weekends.",
                "timestamp": "17/07/2023"
            },
            {
                "reviewer_name": "Nhan Vo",
                "given_stars": 4,
                "content": "Crescent Mall has everything you need, from fashion to food. A great place to spend the day.",
                "timestamp": "24/07/2023"
            },
            {
                "reviewer_name": "Hoa Nguyen",
                "given_stars": 4,
                "content": "Crescent Mall offers a wide range of entertainment options, making it suitable for all ages.",
                "timestamp": "01/08/2023"
            }
        ],
        "pictures": [
            "crescentmall1",
            "crescentmall2",
            "crescentmall3",
            "crescentmall4",
            "crescentmall5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=294dIu6qm_o&ab_channel=Triá»‡uÄÃ´VICTORIAVlogs-Sweden-Viá»‡tNam",
        "website_url": "https://www.crescentmall.com.vn/"
    },
    {
        "name": "Tao Dan Park",
        "address": "Truong Dinh Street, Ben Thanh Ward, District 1, Ho Chi Minh City, Vietnam",
        "location": [
            10.774811921181822,
            106.69242063761992
        ],
        "ratings": 4.5,
        "total_ratings": 13573,
        "entrance_fee": "Free",
        "opening_hours": "6:00 AM - 9:00 PM",
        "short_description": "A great place to enjoy the fresh air and rewind",
        "full_description": "Tao Dan Park, a lush urban oasis nestled in the heart of Ho Chi Minh City, Vietnam, is a beloved green sanctuary that offers respite from the bustling city life. Spanning over 10 hectares, the park serves as a haven for locals and visitors alike, drawing people of all ages to its serene and picturesque surroundings.\n\nAs you enter the park, you are greeted by a canopy of towering trees and a symphony of chirping birds, creating a soothing atmosphere that instantly transports you away from the urban chaos. The well-maintained pathways wind their way through the park, inviting visitors to take leisurely strolls, jog, or simply enjoy a moment of tranquility amid nature's embrace.\n\nTao Dan Park is a place of gathering and social interaction. In the early morning, you will find groups of people practicing tai chi, yoga, or other forms of exercise, fostering a sense of community and wellness. As the day progresses, families and friends converge to enjoy picnics, play games, or engage in various recreational activities.",
        "image_url": "taodanpark",
        "popular_activities": [
            "Relaxation",
            "Morning Exercises",
            "Nature Walks"
        ],
        "nearby_activities": [
            {
                "event_name": "Ho Chi Minh City Museum of Fine Arts",
                "image_url": "paintpalette.fill",
                "ratings": 4.3,
                "fee": "30.000 VND"
            },
            {
                "event_name": "Saigon Opera House",
                "image_url": "music.note",
                "ratings": 4.5,
                "fee": "700.000 VND"
            }
        ],
        "category": "Parks",
        "reviews": [
            {
                "reviewer_name": "Khoa Nguyen",
                "given_stars": 4,
                "content": "Tao Dan Park is a tranquil oasis in the heart of the city. Perfect for morning walks!",
                "timestamp": "05/08/2023"
            },
            {
                "reviewer_name": "Thao Le",
                "given_stars": 4,
                "content": "I enjoy reading books under the shade of trees in Tao Dan Park. Such a lovely atmosphere.",
                "timestamp": "12/08/2023"
            },
            {
                "reviewer_name": "Huy Tran",
                "given_stars": 3,
                "content": "Tao Dan Park is nice, but the litter can be an issue on busy days.",
                "timestamp": "19/08/2023"
            }
        ],
        "pictures": [
            "taodanpark1",
            "taodanpark2",
            "taodanpark3",
            "taodanpark4",
            "taodanpark5"
        ],
        "youtube_url": "https://www.youtube.com/watch?v=SEsRxsfQQaA&ab_channel=MrCrazySmile",
        "website_url": "https://www.vietnamdrive.com/tao-dan-park/"
    }
]
